app/controllers/surveys_controller.rb

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
    @survey = Survey.find(params[:id])

INSERT INTO "surveys" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["text", ""], ["created_at", "2018-02-21 07:30:01.151456"], ["updated_at", "2018-02-21 07:30:01.151456"]]
---
	def create
		@survey = Survey.new(survey_params)

  		@survey.save